#!/bin/bash
echo -e "\e[1;33;4;44m1) Вывести все данные\e[0m"
ls -la | awk '{print $0}'
echo "-------------------------"

echo -e "\e[1;33;4;44m2) Вывести все строки больше 3\e[0m"
ls -la | awk 'length($0) > 3'
echo "-------------------------"

echo -e "\e[1;33;4;44m3) Открыть файл grub со списком установленных ОС\e[0m"
cat /boot/grub/grub.cfg
echo "-------------------------"

echo -e "\e[1;33;4;44m4) Написать утилиту kill\e[0m"
killall ping
echo "-------------------------"

echo -e "\e[1;33;4;44m5) Печатаем длинну самой длинной строки\e[0m"
ls -la | awk '{ if (length($0) > max) max = \
length($0) }
END { print max }'
echo "-------------------------"

echo -e "\e[1;33;4;44m6) Написать регулярное выражение, соответствующее шаблону адреса электронной почты\e[0m"
echo "name@yandex.com" | awk '/^([a-zA-Z0-9_\-\.\+]+)@([a-zA-Z0-9_\-\.]+)\.([a-zA-Z]{2,5})$/{print $0}'
echo "-------------------------"

echo -e "\e[1;33;4;44m7) Написать общее количество килобайтов, используемое файлами в текущей директории\e[0m"
ls -la | awk '{ x += $5 } ; END \
{ print "total kilobytes: " (x + \
1023)/1024 }' 
echo "-------------------------"

echo -e "\e[1;33;4;44m8) Удаляем пустые строки из файла при помощи awk\e[0m"
awk '/./' text.txt
echo "-------------------------"

echo -e "\e[1;33;4;44m9) Удаляем все пробелы из файла при помощи sed\e[0m"
sed s/' '//g -i text.txt
echo "-------------------------"

echo -e "\e[1;33;4;44m10) Удлаяем все пробелы и символы табуляции при помощи sed\e[0m"
sed s/'\s'//g -i text.txt
echo "-------------------------"

echo -e "\e[1;33;4;44m11) Печатаем 7 случайных чисел от 0 до 100\e[0m"
awk 'BEGIN { for (i = 1; i <= 7; i++)
print int(101 * rand()) }'
echo "-------------------------"
